<?php

declare(strict_types = 1);

// Language File for Sypex Dumper 2
$LNG = [

// Information about the language file
	'ver'             => 20005, // Dumper version
	'translated'      => 'samson (http://sypex.net/)', // Contacts
	'name'            => 'Հայերեն', // Lang name

// Toolbar
	'tbar_backup'     => 'Արտահանում',
	'tbar_restore'    => 'Ներմուծում',
	'tbar_files'      => 'Ֆայլեր',
	'tbar_services'   => 'Ծառայություններ',
	'tbar_options'    => 'Ընտրանքներ',
	'tbar_createdb'   => 'Ստեղծել ՏԲ',
	'tbar_connects'   => 'Միացում',
	'tbar_exit'       => 'Ելք',

// Names of objects in the tree
	'obj_tables'      => 'Աղյուսակներ',
	'obj_views'       => 'Դիտումներ',
	'obj_procs'       => 'Ընթացակարգեր',
	'obj_funcs'       => 'Ֆունկցիաներ',
	'obj_trigs'       => 'Տրիգերներ',
	'obj_events'      => 'Իրադարձություններ',

// Export
	'zip_max'         => 'առավելագույն',
	'zip_min'         => 'նվազագույն',
	'zip_none'        => 'Չսեղմված',
	'default'         => 'լռելյայն',
	'combo_db'        => 'Տվյալների բազա:',
	'combo_charset'   => 'Կոդավորում:',
	'combo_zip'       => 'Սեղմում:',
	'combo_comments'  => 'Մեկնաբանություն:',
	'del_legend'      => 'Ավտոմատ ջնջել, եթե:',
	'del_date'        => 'ֆայլերի տարիքը ավելին է, քան %s օր',
	'del_count'       => 'ֆայլերի քանակը ավելին է քան %s',
	'tree'            => 'Ընտրեք օբյեկտները:',
	'no_saved'        => 'Չպահպանված առաջադրանքներ',
	'btn_save'        => 'Պահպանել',
	'btn_exec'        => 'Իրականացնել',

// Import
	'combo_file'      => 'Ֆայլ:',
	'combo_strategy'  => 'Վերականգնել ռազմավարությունը:',
	'ext_legend'      => 'Ընդլայնված ընտրանքներ:',
	'correct'         => 'Կոդավորման ուղղում',
	'autoinc'         => 'Վերագործարկել AUTO_INCREMENT',

// Log
	'status_current'  => 'Ընթացիկ կարգավիճակը:',
	'status_total'    => 'Ընդհանուր կարգավիճակը:',
	'time_elapsed'    => 'Անցավ:',
	'time_left'       => 'Ձախ:',
	'btn_stop'        => 'Անջատել',
	'btn_pause'       => 'Դադար',
	'btn_resume'      => 'Շարունակել',
	'btn_again'       => 'Կրկնել',
	'btn_clear'       => 'Մաքրել լոգը',

// Files
	'btn_delete'      => 'Ջնջել',
	'btn_download'    => 'Ներբեռնել',
	'btn_open'        => 'Բացել',

// Services
	'opt_check'       => 'Ստուգման ընտրանքներ:',
	'opt_repair'      => 'Վերանորոգման ընտրանքներ:',
	'btn_delete_db'   => 'Ջնջել ՏԲ',
	'btn_check'       => 'Ստուգել',
	'btn_repair'      => 'Վերականգնել',
	'btn_analyze'     => 'Վերլուծել',
	'btn_optimize'    => 'Օպտիմալացնել',

// Options
	'cfg_legend'      => 'Հիմնական պարամետրեր:',
	'cfg_time_web'    => 'Կատարման ժամանակը վեբում (վայրկյան):',
	'cfg_time_cron'   => 'Կատարման ժամանակը cron-ում (վայրկյան):',
	'cfg_backup_path' => 'backup թղթապանակի ուղին:',
	'cfg_backup_url'  => 'backup թղթապանակի URL-ը:',
	'cfg_globstat'    => 'Գլոբալ վիճակագրություն:',
	'cfg_extended'    => 'Ընդլայնված պարամետրեր:',
	'cfg_charsets'    => 'Կոդավորման ֆիլտր:',
	'cfg_only_create' => 'Միայն ստեղծել կառուցվածքը:',
	'cfg_auth'        => 'Թույլտվությունների շղթա:',
	'cfg_confirm'     => 'Հարցնել հաստատում:',
	'cfg_conf_import' => 'Ներմուծել ՏԲ',
	'cfg_conf_file'   => 'Ջնջել ֆայլը',
	'cfg_conf_db'     => 'Ջնջել ՏԲ',

// Connection
	'con_header'      => 'Միացման կարգավորումները',
	'connect'         => 'Միացում',
	'my_host'         => 'Հոսթ:',
	'my_port'         => 'Պորտ:',
	'my_user'         => 'Օգտվող:',
	'my_pass'         => 'Գաղտնաբառ:',
	'my_pass_hidden'  => 'Գաղտնաբառը չի ցուցադրվում',
	'my_comp'         => 'Կոմպրեսիոն արձանագրություն',
	'my_db'           => 'Տվյալների բազա:',
	'btn_cancel'      => 'Չեղարկել',

// Save Job
	'sj_header'       => 'Պահպանել առաջադրանքը',
	'sj_job'          => 'Առաջադրանք',
	'sj_name'         => 'Անուն  (անգլ.):',
	'sj_title'        => 'Նկարագրություն:',

// Create DB
	'cdb_header'      => 'Ստեղծել նոր Տվյալների բազա',
	'cdb_detail'      => 'Մանրամասներ',
	'cdb_name'        => 'Անուն:',
	'combo_collate'   => 'Համեմատել:',
	'btn_create'      => 'Ստեղծել',

// Authorization
	'js_required'     => 'JavaScript-ը պետք է միացվի',
	'auth'            => 'Լիազորություն',
	'auth_user'       => 'Օգտվող:',
	'auth_remember'   => 'Հիշել',
	'btn_enter'       => 'Մուտք',
	'btn_details'     => 'Մանրամասներ',

// Log messages
	'not_found_rtl'   => 'Բացակայում է RTL-ֆայլը',
	'backup_begin'    => 'ՏԲ արտահանման սկիզբ `%s`',
	'backup_TC'       => 'Աղյուսակի արտահանում `%s`',
	'backup_VI'       => 'Արտահանել `%s` -ի տեսքը',
	'backup_PR'       => 'Արտահանել `%s` -ի ընթացակարգերը',
	'backup_FU'       => 'Արտահանել `%s` -ի ֆունկցիաները',
	'backup_EV'       => 'Արտահանել  `%s` -ի իրադարձությունը',
	'backup_TR'       => 'Արտահանել `%s` -ի տրիգերը',
	'continue_from'   => '`%s` -ի դիրքից',
	'backup_end'      => '`%s` ՏԲ-ի արտահանումը ավարտվեց.',
	'autodelete'      => 'Հին ֆայլերի ավտոմատ ջնջում:',
	'del_by_date'     => '- `%s` - ջնջված (ըստ ամսաթվի)',
	'del_by_count'    => '- `%s` - ջնջված (ըստ հաշվարկի)',
	'del_fail'        => '- `%s` - ջնջելը ձախողվեց',
	'del_nothing'     => '- ջնջելու ֆայլեր չկան',
	'set_names'       => 'Սահմանել կապակցման կոդավորումը: `%s`',
	'restore_begin'   => '`%s` ՏԲ ներմուծումը սկսվեց',
	'restore_TC'      => '`%s` աղյուսակի ներմուծում',
	'restore_VI'      => '`%s` դիտման ներմուծում',
	'restore_PR'      => '`%s` ընթացակարգի ներմուծում',
	'restore_FU'      => '`%s` ֆունկցիաի ներմուծում',
	'restore_EV'      => '`%s` իրադարձության ներմուծում',
	'restore_TR'      => '`%s` տրիգերի ներմուծում',
	'restore_keys'    => 'Ակտիվացնել ինդեքսները',
	'restore_end'     => '`%s` ՏԲ-ն վերականգնվել է կրկնօրինակից.',
	'stop_1'          => 'Կատարումը ընդհատվել է օգտագործողի կողմից',
	'stop_2'          => 'Կատարումը դադարեցվել է օգտագործողի կողմից',
	'stop_3'          => 'Կատարումը դադարեցվել է ըստ ժամանակի',
	'stop_4'          => 'Կատարումը դադարեցվել է (timeout)',
	'stop_5'          => 'Կատարումը չեղյալ է համարվել սխալի պատճառով',
	'job_done'        => 'Առաջադրանքը հաջողությամբ կատարվել է:',
	'file_size'       => 'Ֆայլի չափը',
	'job_time'        => 'Ծախսված ժամանակը',
	'seconds'         => 'վայրկյան',
	'job_freeze'      => 'Գործընթացը չի թարմացվել ավելի քան 30 վայրկյան: Սեղմեք Շարունակել',
	'stop_job'        => 'Դադարեցնել հարցումը',

// For JS
	'js'              => [

		// Tabs names
		'backup'       => 'ՏԲ արտահանում',
		'restore'      => 'ՏԲ ներմուծում',
		'log'          => 'Գործողության լոգ',
		'result'       => 'Արդյունքներ',
		'files'        => 'Ֆայլեր',
		'services'     => 'Ծառայություններ',
		'options'      => 'Ընտրանքներ',

		// Tables header
		'dt'           => 'Ամսաթիվ/ժամանակ',
		'action'       => 'Գործողություն',
		'db'           => 'Տվյալների Բազա',
		'type'         => 'Տիպ',
		'tab'          => 'Աղյուսակներ',
		'records'      => 'Գրառումներ',
		'size'         => 'Չափ',
		'comment'      => 'Կարծիքներ',

		// AJAX Status
		'load'         => 'Բեռնում',
		'run'          => 'Կատարում...',
		'sdb'          => 'ՏԲ ստեղծում',
		'sc'           => 'Կապակցման պահպանում',
		'sj'           => 'Առաջադրանքի պահպանում',
		'so'           => 'Ընտրանքների պահպանում',

		// Messages
		'pro'          => 'Ընտրանքը հասանելի է միայն Pro տարբերակում',
		'err_fopen'    => 'Չի հաջողվում բացել ֆայլը',
		'err_sxd2'     => 'Ֆայլի բովանդակությունը դիտելը հնարավոր է միայն Sypex Dumper 2 -ով ստեղծված ֆայլերի համար',
		'err_empty_db' => 'ՏԲ-ն դատարկ է',
		'fdc'          => 'Դուք ուզու՞մ եք ջնջել ֆայլը:',
		'ddc'          => 'Դուք ուզու՞մ եք ջնջել ՏԲ-ն:',
		'fic'          => 'Դուք ուզու՞մ եք ներմուծել ֆայլը:',

		// Sizes
		'sizes'        => ['Բ', 'ԿԲ', 'ՄԲ', 'ԳԲ'],
	],
];

